<a href="https://colab.research.google.com/github/GlennBSIT3205/IT-BA-3205_Coalesce/blob/main/Education%20in%20the%20Philippines%20Visualization.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# **Number of Enrollment and Graduates by different Courses (2016-2019)**

  There are 21 discipline groups, and the overall number of enrolled and graduates from 2016 to 2019 is shown. We can distinguish which courses have the highest and lowest number by analyzing the data.

In [ ]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Enrollment%26Graduates%20by%20Discipline.csv'
pd.options.display.max_rows = 30
df = pd.read_csv(url)
display(df)

,Unnamed: 0,Enrollment,Unnamed: 2,Unnamed: 3,Graduates,Unnamed: 5,Unnamed: 6
0,Discipline Group,2016-17,2017-18,2018-19,2016-17,2017-18,2018-19
1,"Agriculture, Forestry, Fisheries","127,287","100,922","106,006","24,210","26,773","26,259"
2,Architecture and Town Planning,"40,238","33,439","40,163","4,828","5,900","5,697"
3,Business Administration and Related,"921,324","775,805","826,494","202,895","207,178","233,194"
4,Education Science and Teacher Training,"740,713","639,063","653,207","138,496","162,900","169,832"
5,Engineering and Tech,"448,550","370,710","424,269","82,794","86,860","87,083"
6,Fine and Applied Arts,"16,324","16,355","23,782","4,100","4,465","3,572"
7,General,"7,614","4,869","4,847","1,468",581,575
8,Home Economics,"5,960","4,876","4,324","1,236",970,"1,256"
9,Humanities,"40,753","36,332","37,246","6,877","7,947","9,397"
10,IT-Related Disciplines,"398,765","315,694","314,414","73,646","77,747","81,477"
11,Law and Jurisprudence,"23,239","23,422","24,520","2,613","3,091","3,246"
12,Maritime,"119,387","82,205","87,960","21,561","17,634","16,871"
13,Mass Communication and Documentation,"36,527","29,114","30,034","8,230","8,436","8,638"
14,Mathematics,"14,109","11,814","12,315","3,034","3,446","3,192"
15,Medical and Allied,"203,561","176,532","215,234","43,012","42,425","45,301"
16,Natural Science,"34,923","29,307","31,188","7,160","8,693","8,249"
17,Other Disciplines,"212,709","171,399","204,335","37,799","42,293","46,645"
18,Religion and Theology,"8,351","7,628","6,897","1,746","1,850","2,059"
19,Service Trades,"73,905","55,671","61,250","15,205","16,947","17,690"
20,Social and Behavioral Sciences,"114,834","96,428","103,906","22,324","25,099","26,240"
21,"Trade, Craft and Industrial",411,218,151,93,75,103
22,Grand Total,"3,589,484","2,981,803","3,212,542","703,327","751,310","796,576"

# **Enrollment and Graduates in State Universities and Colleges by Region**

## **Ilocos Region**
  The Ilocos Region has six state universities and colleges, and this data shows the number of students enrolled and graduates from 2017 to 2019. Every year, we can see a comparison of the number of students enrolled and graduates, and we can tell which school has the most and least students.

In [ ]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[0:8])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,Region,SUC Name,NaN,Enrollment,NaN,NaN,Graduates,NaN,NaN,NaN
1,NaN,NaN,NaN,2017-18,2018-19,2019-20,2016-17,2017-18,2018-19,NaN
2,Ilocos Region,Don Mariano Marcos Memorial State University,NaN,"13,320","13,533","13,802","3,523","3,569","2,654",NaN
3,NaN,Ilocos Sur Polytechnic State College,NaN,"4,782","4,889","8,362",516,624,"1,659",NaN
4,NaN,Mariano Marcos State University,NaN,"8,247","7,979","9,487","3,779","2,934","3,249",NaN
5,NaN,North Luzon Philippines State College,NaN,"2,147","2,371","2,748",644,728,755,NaN
6,NaN,Pangasinan State University,NaN,"18,495","20,355","20,584","4,503","5,556","6,519",NaN
7,NaN,University of Northern Philippines,NaN,"9,446","7,037","7,038","3,105","3,030","3,079",NaN

## **Cagayan Valley**

In [ ]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[8:13])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
8,Cagayan Valley,Batanes State College,NaN,268,698,393,44,44,108,NaN
9,NaN,Cagayan State University,NaN,"25,056","21,914","22,855","5,077","4,384","5,696",NaN
10,NaN,Isabela State University,NaN,"22,371","22,038","29,513","7,225","5,524","7,498",NaN
11,NaN,Nueva Vizcaya State University,NaN,"8,135","9,143","9,538","1,694","1,542","1,694",NaN
12,NaN,Quirino State University,NaN,"3,626","3,800","3,541",788,943,467,NaN

## **Central Luzon**

In [ ]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[13:25])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
13,Central Luzon,Aurora State College of Technology,NaN,"1,682","2,498","2,873",750,572,609,NaN
14,NaN,Bataan Peninsula State University,NaN,"12,114","12,108","12,126","2,949","3,342","3,203",NaN
15,NaN,Bulacan Agricultural State College,NaN,"2,740","3,409","3,784",732,791,945,NaN
16,NaN,Bulacan State University,NaN,"34,632","33,718","36,955","11,642","9,371","12,580",NaN
17,NaN,Central Luzon State University,NaN,"8,698","9,628","10,427","2,409","2,595","2,885",NaN
18,NaN,Don Honorio Ventura Technological State Univer...,NaN,"14,869","20,536","24,905","4,768","3,188","4,463",NaN
19,NaN,Nueva Ecija University of Science and Technology,NaN,"20,216","24,391","22,597","4,217","5,460","4,534",NaN
20,NaN,Pampanga State Agricultural University,NaN,"4,056","4,557","5,144","1,043","1,207","1,402",NaN
21,NaN,Philippine Merchant Marine Academy,NaN,929,775,"1,104",243,-,182,NaN
22,NaN,President Ramon Magsaysay State University,NaN,"7,156","8,693","10,513","2,073","2,047","1,872",NaN
23,NaN,Tarlac Agricultural University,NaN,"3,019","4,042","5,210",929,"1,072","1,034",NaN
24,NaN,Tarlac State University,NaN,"13,504","16,593","16,528","2,669","3,690","4,427",NaN

## **CALABARZON**

In [ ]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[25:30])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
25,CALABARZON,Batangas State University,NaN,"27,246","40,431","33,076","5,159","9,542","7,312",NaN
26,NaN,Cavite State University,NaN,"32,693","40,819","43,634","6,590","7,239","8,897",NaN
27,NaN,Laguna State Polytechnic University,NaN,"21,326","23,040","24,248","6,326","5,780","6,636",NaN
28,NaN,Southern Luzon State University,NaN,"11,465","8,309","7,303","3,686","4,385","3,954",NaN
29,NaN,University of Rizal System,NaN,"15,638","15,811","18,663","5,049","5,103","5,970",NaN

## **Bicol Region**

In [2]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[30:39])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
30,Bicol Region,Bicol State College of Applied Sciences and Te...,NaN,"4,176","3,981","3,673",713,874,"1,212",NaN
31,NaN,Bicol University,NaN,"16,277","15,947","17,569","7,422","6,987","7,287",NaN
32,NaN,Camarines Norte State College,NaN,"5,280","5,297","6,282","1,307","1,288","1,708",NaN
33,NaN,Camarines Sur Polytechnic Colleges,NaN,"3,554","5,122","3,478","3,416","3,458","2,355",NaN
34,NaN,Catanduanes State University,NaN,"5,759","6,551","6,450","1,777","1,781","2,233",NaN
35,NaN,Central Bicol State University of Agriculture,NaN,"9,221","9,499","9,312","1,730","2,375","2,549",NaN
36,NaN,"Dr. Emilio B. Espinosa, Sr. Memorial State Col...",NaN,"4,101","4,619","4,659",886,"1,345",761,NaN
37,NaN,Partido State University,NaN,"5,853","5,579","5,200","2,232","2,864","2,141",NaN
38,NaN,Sorsogon State College,NaN,"7,201","7,634","9,465","1,537","1,621","1,985",NaN

## **Western Visayas**

In [3]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[39:50])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
39,Western Visayas,Aklan State University,NaN,"6,165","6,566","6,984","2,239","2,958","2,841",NaN
40,NaN,Capiz State University,NaN,"10,628","12,883","13,974","3,387","3,298","3,480",NaN
41,NaN,Carlos Hilado Memorial State College,NaN,"11,285","10,187","10,310","2,666","3,055","3,473",NaN
42,NaN,Central Philippines State University,NaN,"9,809","11,627","10,878","1,327","1,988","2,534",NaN
43,NaN,Guimaras State College,NaN,"2,632","4,770","3,869",559,"1,207","1,105",NaN
44,NaN,Iloilo Science and Technology University,NaN,"10,224","11,102","11,676","2,380","2,978","3,618",NaN
45,NaN,Iloilo State College of Fisheries,NaN,"3,946","4,650","4,839",816,885,"1,473",NaN
46,NaN,Northern Iloilo Polytechnic State College,NaN,"7,135","7,971","8,787","2,524","1,395","1,480",NaN
47,NaN,Northern Negros State College of Science and T...,NaN,"5,117","7,310","8,066",775,"1,633","1,751",NaN
48,NaN,University of Antique,NaN,"9,547","11,395","11,904","2,132","2,435","2,673",NaN
49,NaN,West Visayas State University,NaN,"15,587","13,769","12,641","5,241","4,550","5,434",NaN

## **Central Visayas**

In [4]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[50:55])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
50,Central Visayas,Bohol Island State University,NaN,"13,784","16,170","15,417","3,342","4,185","4,287",NaN
51,NaN,Cebu Normal University,NaN,"7,165","6,913","6,675","2,375","2,730","2,272",NaN
52,NaN,Cebu Technological University,NaN,"35,926","39,398","41,395","12,836","13,424","13,963",NaN
53,NaN,Negros Oriental State University,NaN,"23,887","26,411","25,804","4,811","5,293","6,824",NaN
54,NaN,Siquijor State College,NaN,"1,263","1,472","1,773",477,346,269,NaN

## **Eastern Visayas**

In [5]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[55:65])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
55,Eastern Visayas,Eastern Samar State University,NaN,"11,989","13,068","13,866","2,684","3,291","3,593",NaN
56,NaN,Eastern Visayas State University,NaN,"16,369","19,462","18,860","3,262","3,911","4,463",NaN
57,NaN,Leyte Normal University,NaN,"4,937","5,951","6,499","1,272","1,607","1,854",NaN
58,NaN,Biliran Province State University,NaN,"6,172","6,945","7,572","1,625","1,651","1,740",NaN
59,NaN,Northwest Samar State University,NaN,"6,378","7,182","7,814","1,870","1,821","2,271",NaN
60,NaN,Palompon Institute of Technology,NaN,"3,624","4,366","5,335",888,"1,032","1,014",NaN
61,NaN,Samar State University,NaN,"6,071","6,518","6,882",748,"1,733","1,219",NaN
62,NaN,Southern Leyte State University,NaN,"8,271","8,939","9,772","1,917","2,152","2,655",NaN
63,NaN,University of Eastern Philippines,NaN,"12,035","12,635","7,291","2,541","2,746","1,812",NaN
64,NaN,Visayas State University,NaN,"10,711","10,972","12,098","2,597","2,668","3,015",NaN

## **Zamboanga Peninsula**

In [6]:
url = 'https://raw.githubusercontent.com/GlennBSIT3205/IT-BA-3205_Coalesce/main/Data%20Sets/Higher-Education-Enrollment-and-Graduates-in-State-Universities-and-Colleges-1-converted.csv'
df = pd.read_csv(url)
display(df.iloc[65:71])

,Table 3A. Higher Education Enrollment and Graduates in State Universities and Colleges,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
65,Zamboanga Peninsula,Basilan State College,NaN,"3,769","4,240","4,240","1,124","1,124","1,124",NaN
66,NaN,Jose Rizal Memorial State University,NaN,"12,226","13,642","17,194","2,383","2,740","3,042",NaN
67,NaN,Josefina H. Cerilles State College,NaN,"11,185","21,753","13,546","2,246","4,951","1,974",NaN
68,NaN,Western Mindanao State University,NaN,"26,664","33,034","26,706","5,541","5,771","4,485",NaN
69,NaN,Zamboanga City State Polytechnic College,NaN,"5,776","6,494","8,843","1,098","1,281","1,644",NaN
70,NaN,Zamboanga State College of Marine Sciences and...,NaN,"4,454","4,530","4,530",772,777,777,NaN